Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПривязкаОтветственный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаОтветственный</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>Контакты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результативных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НетКонтакта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОставленаИнформация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/КонтактыДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>КонтактыДокументы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СтатусыДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДолжников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПланированиеКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеКонтактов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Контакт/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Ответственный = Привязка.ПолучитьОтветственного(Должник, МоментВремени());
	
	Отказ = ДоступностьИзмененийПоДатеЗапрета(Дата);
	
	// Определить нового ответственного
	Если (НЕ Статус.НетКонтакта) И 
		ТипКонтакта.ПередачаОтветственного И 
		Сотрудник.МожетБытьОтветственным Тогда
		
		Движение = Движения.ПривязкаОтветственный.Добавить();
		Движение.Период 		= Дата;
		Движение.Должник 		= Должник;
		Движение.Ответственный 	= Сотрудник;
	КонецЕсли; 
	
	// Регистрация количества контактов
	Для каждого СтрокаТелефоны Из Телефоны Цикл
		// регистр Контакты
		Движение = Движения.Контакты.Добавить();
		Движение.Период 		= Дата;
		Движение.Ответственный 	= Ответственный;
		Движение.Сотрудник 		= Сотрудник;
		Движение.Должник 		= Должник;
		Движение.ТипКонтакта 	= ТипКонтакта;
		Движение.Всего 			= 1;
		
		Если СтрокаТелефоны.РезультатКонтакта.НетКонтакта Тогда
			Движение.НетКонтакта	= 1;
		Иначе	
			Движение.Результативных	= 1;
			Если СтрокаТелефоны.РезультатКонтакта = Справочники.РезультатыКонтактов.ОставленаИнформация Тогда
				Движение.ОставленаИнформация = 1;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	// Регистрация количества контактов
	// Статистика по должникам
	Движение = Движения.КонтактыДокументы.Добавить();
	Движение.Период 		= Дата;
	Движение.Сотрудник 		= Сотрудник;
	Движение.Должник 		= Должник;
	Движение.Всего 			= 1;
	
	Если СделатьСтатусОсновным Тогда
		Если Статус = Справочники.Статусы.НайтиПоКоду("000000017") Тогда // шшш что за статус
			Отказ = Истина
		КонецЕсли;
		// Новый статус должника
		Движение = Движения.СтатусыДолжников.Добавить();
		Движение.Период 	= Дата;
		Движение.Должник 	= Должник;
		Движение.Статус 	= Статус;
	КонецЕсли; 
	
	// Дата следующего контакта
	//Если НЕ РольДоступна("Администратор") Тогда
	Если Найти(ТипКонтакта,"Отправка") = 0 Тогда
		Движение = Движения.ПланированиеКонтактов.Добавить();
		Движение.Период 			= Дата;
		Движение.ДатаПланирования 	= ДатаПланирования;
		Движение.Должник 			= Должник;
	КонецЕсли;
	
	// +Крылов 2011.03.25
	Если НЕ РольДоступна("Администратор") И Должник.Новый Тогда
		ОбъектДолжник = Должник.ПолучитьОбъект();
		ОбъектДолжник.Новый = Ложь;
		ОбъектДолжник.Записать();
	КонецЕсли;
	// -Крылов 2011.03.25
	
	//----  Пока отключу БП
	//БП=БизнесПроцессы.БизнесПроцесс_ПривязкаДолжника.СоздатьБизнесПроцесс();
	//
	//БП.Дата= Дата;
	//БП.Контакт=Ссылка;
	//БП.Автор=Ссылка.Автор;
	//БП.Наименование="Создан БП___";
	//БП.ДатаЗавершения=ТекущаяДата();
	//
	//
	//БП.Записать();
	//
	//БП.Старт();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗадачаПривязкаДолжника.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Задача.ЗадачаПривязкаДолжника КАК ЗадачаПривязкаДолжника
	//	|ГДЕ
	//	|	ЗадачаПривязкаДолжника.БизнесПроцесс.Контакт = &Контакт";
	//
	//Запрос.УстановитьПараметр("Контакт", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//кол=ВыборкаДетальныеЗаписи.Количество();
	//Если кол<>0  Тогда
	//
	//	    ВыборкаДетальныеЗаписи.Следующий();
	//
	//		задачаТ=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//		задачаТ.Сотрудник=Ссылка.Автор;
	//		задачаТ.ВыполнитьЗадачу();
	//	
	//
	//КонецЕсли;
	  	
	//	-------------	
	
	
	
	
				
			//БП_РезЗвонка= БизнесПроцессы.БизнесПроцесс_РезультатЗвонка.СоздатьБизнесПроцесс();
			//БП_РезЗвонка.Дата= Дата;
			//БП_РезЗвонка.Контакт=Ссылка;
			//БП_РезЗвонка.Автор=Ссылка.Автор;
			//БП_РезЗвонка.Наименование="Создан БП___"+Ссылка.Должник;
			//БП_РезЗвонка.ДатаОжиданияОплатил=ТекущаяДата();
			//БП_РезЗвонка.ДатаЗавершения=ТекущаяДата();
			//
			//БП_РезЗвонка.Должник=Должник;
			// 
			//БП_РезЗвонка.РезультатКонтактаБП=РезультатКонтактаБП();
			// 
			//
			//БП_РезЗвонка.Записать();
			//
			//БП_РезЗвонка.Старт();

	
	
КонецПроцедуры


&НаСервере
Функция РезультатКонтактаБП()

	спрРезКонтакта=Неопределено;
	
	спрРез_Оплатил=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Обещание оплатить",Истина);
	спрРез_НетКонтакта=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Нет контакта",Истина);
	спрРез_ОтказОтОплаты=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Отказ от оплаты",Истина);
	спрРез_Осужден=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Осужден",Истина);   
	
	спрРез_НеверныеКонтактныеДанные=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Неверные контактные данные",Истина);   
	
	спрРез_КлиентаНеЗнают=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Клиента не знают",Истина);   

	спрРез_ОтрицаетПолученияКредита=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Отрицает получение кредита",Истина);   
	
	спрРез_КлиентУмер=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Клиент умер",Истина);   
	
	спрРез_СтраховойСлучай=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Страховой случай",Истина);   
	
	спрРез_ГосВедомствоЗапросДокументов=Справочники.РезультатыКонтактов.НайтиПоНаименованию("Гос.ведомство запрос документов",Истина);   
	
	
	Для каждого телРез Из Ссылка.Телефоны  Цикл
		
		
        Если телРез.РезультатКонтакта=спрРез_Оплатил Тогда
		
			спрРезКонтакта=спрРез_Оплатил;
		
		ИначеЕсли  телРез.РезультатКонтакта=спрРез_НетКонтакта Тогда
			
			 спрРезКонтакта=спрРез_НетКонтакта;
			 
		ИначеЕсли  телРез.РезультатКонтакта=спрРез_ОтказОтОплаты Тогда
			
			 спрРезКонтакта=спрРез_ОтказОтОплаты;
			 
	     ИначеЕсли  телРез.РезультатКонтакта=спрРез_Осужден Тогда
			
			 спрРезКонтакта=спрРез_Осужден;
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_НеверныеКонтактныеДанные Тогда
			
			 спрРезКонтакта=спрРез_НеверныеКонтактныеДанные;
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_КлиентаНеЗнают Тогда
			
			 спрРезКонтакта=спрРез_КлиентаНеЗнают;
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_ОтрицаетПолученияКредита Тогда
			
			 спрРезКонтакта=спрРез_ОтрицаетПолученияКредита;
			 
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_КлиентУмер Тогда
			
			 спрРезКонтакта=спрРез_КлиентУмер;
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_СтраховойСлучай Тогда
			
			 спрРезКонтакта=спрРез_СтраховойСлучай;
			 
		 ИначеЕсли  телРез.РезультатКонтакта=спрРез_ГосВедомствоЗапросДокументов Тогда
			
			 спрРезКонтакта=спрРез_ГосВедомствоЗапросДокументов;
			 
			 
		Иначе	
			
			  спрРезКонтакта=спрРез_НетКонтакта;
		
		КонецЕсли;  		
		
		
	
	КонецЦикла;
	
	
    Возврат спрРезКонтакта;	
	

КонецФункции // ()







Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Планирование") Тогда
		// Заполнение шапки
		Должник 		= Основание.Должник;
		Комментарий 	= Основание.Комментарий;
		Сотрудник 		= Основание.Сотрудник;
		ТипКонтакта 	= Основание.ТипКонтакта;
		Планирование 	= Основание.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если (Статус = Справочники.Статусы.ОплатилПолностью) И (Дата >='20120501') Тогда
		Сообщить("Статус ""Оплатил полностью"" не может быть присвоен вручную");
		Отказ = Истина
	КонецЕсли;
	
	Если Дата > '20120615' Тогда
		Если НЕ ЗначениеЗаполнено(ТипКонтакта) Тогда
			Сообщить("Не заполнен реквизит Тип контакта!");
			Отказ = Истина;
		КонецЕсли;
		
		Комментарий = КомментарийАдминистратора;
		Если ЗначениеЗаполнено(КомментарийСотрудника) Тогда
			Комментарий = Комментарий + ?(Комментарий = "", "", Символы.ПС) + КомментарийСотрудника;
		КонецЕсли;
		
		Для каждого ТекСтр Из Телефоны Цикл
			Если НЕ ЗначениеЗаполнено(СокрЛП(ТекСтр.Комментарий)) Тогда
				Сообщить("В строке № "+ТекСтр.НомерСтроки+" не заполнен реквизит Комментарий!");
				Отказ = Истина;
			КонецЕсли;
			Если (НЕ ЗначениеЗаполнено(СокрЛП(ТекСтр.КонтактноеЛицо))) И (ТипКонтакта = Справочники.ТипыКонтактов.НайтиПоНаименованию("Комментарий")) Тогда
				Сообщить("В строке № "+ТекСтр.НомерСтроки+" не заполнен реквизит Контактное лицо!");
				Отказ = Истина;
			КонецЕсли;
			Если (НЕ ЗначениеЗаполнено(СокрЛП(ТекСтр.РезультатКонтакта))) И (ТипКонтакта = Справочники.ТипыКонтактов.НайтиПоНаименованию("Комментарий")) Тогда
				Сообщить("В строке № "+ТекСтр.НомерСтроки+" не заполнен реквизит Результат контакта!");
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СокрЛП(ТекСтр.Телефон)) Тогда
				Сообщить("В строке № "+ТекСтр.НомерСтроки+" не заполнен реквизит Телефон!");
				Отказ = Истина;
			КонецЕсли;
			Комментарий = Комментарий + ?(Комментарий = "", "", Символы.ПС) + Текстр.Телефон + " " + ТекСтр.Комментарий;
		КонецЦикла;
		
	КонецЕсли;	
	Если РольДоступна("Администратор") Тогда
		Отказ = Ложь;
	КонецЕсли;
КонецПроцедуры
